In [9]:
def my_sq(x):
    return x ** 2 # 첫번째 인수는 선택한 apply 데이터를 받음, 선택한 것은 첫번째 인자값, 두번째는 밖에서
  
def my_exp(x,n):
    return x ** n

In [10]:
my_sq(4)

16

In [11]:
my_exp(5,4)

625

In [4]:
import pandas as pd

In [13]:
df = pd.DataFrame({'a': [10,20,30],
                          'b':[20,30,40]})

In [14]:
df['a'].apply(my_sq) # axis가 0이면 행 단위

0    100
1    400
2    900
Name: a, dtype: int64

In [15]:
df['a'].apply(my_exp,n=3)

0     1000
1     8000
2    27000
Name: a, dtype: int64

In [21]:
def ddd(x): #변수 들어오는 것 하나
    print(x[0]*x[1]) #컬럼 여러 개면 인덱스로 접근
    return x[0]*x[1]

In [17]:
ddd(3)

3

3

In [18]:
ddd((2,3))

(2, 3)

(2, 3)

In [22]:
df.apply(ddd,axis=1) # axis=0 열을 기준으로 묶어 줌, 1은 행을 기준으로

200
600
1200

0     200
1     600
2    1200
dtype: int64

In [23]:
import seaborn as sns

In [24]:
titanic = sns.load_dataset('titanic')

In [25]:
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [26]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [28]:
def count_missing(vec):
    null_count = pd.isnull(vec).sum()
    return null_count

In [29]:
titanic.apply(count_missing)

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [31]:
def prop_missing(vec):
    num = count_missing(vec)
    dem = vec.size
    return num/dem

In [32]:
titanic.apply(prop_missing)

survived       0.000000
pclass         0.000000
sex            0.000000
age            0.198653
sibsp          0.000000
parch          0.000000
fare           0.000000
embarked       0.002245
class          0.000000
who            0.000000
adult_male     0.000000
deck           0.772166
embark_town    0.002245
alive          0.000000
alone          0.000000
dtype: float64

In [33]:
def prop_complete(vec):
    return 1-prop_missing(vec)

In [35]:
titanic.apply(prop_complete)

survived       1.000000
pclass         1.000000
sex            1.000000
age            0.801347
sibsp          1.000000
parch          1.000000
fare           1.000000
embarked       0.997755
class          1.000000
who            1.000000
adult_male     1.000000
deck           0.227834
embark_town    0.997755
alive          1.000000
alone          1.000000
dtype: float64

In [42]:
titanic['age'].shift(-1) #shift(-1) 한 칸씩 앞으로, 1은 한 칸씩 뒤로/ ex) 코로나 누적 건수로 당일 발생한 환자 확인

0      38.0
1      26.0
2      35.0
3      35.0
4       NaN
       ...
886    19.0
887     NaN
888    26.0
889    32.0
890     NaN
Name: age, Length: 891, dtype: float64